---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.op_Equality(Autodesk.Revit.DB.FailureMessageKey,Autodesk.Revit.DB.FailureMessageKey)
source: html/e2563edc-eb05-9277-6683-72b8b2256764.htm
---
# Autodesk.Revit.DB.FailureMessageKey.op_Equality Method

Determines whether two FailureMessageKeys are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	FailureMessageKey first,
	FailureMessageKey second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.FailureMessageKey`) - The first FailureMessageKey.
- **second** (`Autodesk.Revit.DB.FailureMessageKey`) - The second FailureMessageKey.

## Returns
True if the FailureMessageKeys are the same; otherwise, false.